name: "digit_recognition"
platform: "onnxruntime_onnx"
max_batch_size: 1
version_policy: { latest: { num_versions: 1 } }

input [
  {
    name: "input"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [1, 28, 28]
  }
]

output [
  {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: [10]
    label_filename: ""
  }
]
